In [56]:
import pandas as pd

## Pandas
    1.Series : 1차원 Vector
    2.DataFrame : 2차원 Matrix
        *모두 명시적인 index 갖음

## Series

In [73]:
L = [1,2,3,5]
pd.Series(L)  # index를 명시하지 않으면 자동으로 0~ 생성

0    1
1    2
2    3
3    5
dtype: int64

In [60]:
L = [1,2,3,5]
pd.Series(L,index = ['a','b','c','d'])  # index를 지정하면 지정된 index로 생성

a    1
b    2
c    3
d    5
dtype: int64

In [4]:
L = {'a':1,'b':2,'c':3,'d':4}
pd.Series(L)    #dict의 경우 key값이 index가 됨.

a    1
b    2
c    3
d    4
dtype: int64

In [61]:
L = {'a':1,'b':2,'c':3,'d':4}
S = pd.Series(L,index=['a','b','c','d','e','f','g'])    #dict에서 index지정시 values가 없으면 NaN으로 출력
S

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [6]:
S['c']

3.0

In [7]:
S['g'] = 100
S

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    100.0
dtype: float64

In [8]:
S.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [9]:
S.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 100.])

##  DataFrame

In [64]:
raw_data = {'first_name' : ['jason','molly','tina','jake','any'], 'last_name' : ['miller','jacobson','ali','milner','cooze'],
           'age' : [42,52,36,24,75],'city' : ['san francisco','baltimore','miami','douglas','boston']}
raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [65]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

### column
    df['칼럼명'] : 해당 칼럼을 출력

In [12]:
pd.DataFrame(raw_data,columns=['last_name','first_name'])  # column 지정가능

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [13]:
df['first_name']  # column명으로 column선택

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [14]:
df[['last_name','first_name']]

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [15]:
df.index=['a','b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

### row
    df.loc['인덱스명'] : 해당 row를 선택
    df.iloc[row번호] : 해당 row를 선택

In [16]:
df.loc['e']

first_name       any
last_name      cooze
age               75
city          boston
Name: e, dtype: object

In [17]:
df.iloc[2]

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

### slicing
    df.loc['인덱스명','칼럼명']
    df.iloc['인덱스번호','칼럼번호']
#### 범위로 slicing
    df.loc['인덱스명':'인덱스명','칼럼명':'칼럼명']
    df.iloc['인덱스번호':'인덱스번호','칼럼번호':'칼럼번호]
    * column범위 출력시 ':,' 붙혀줘야 함(row는 불필요)

In [18]:
df.loc[['b','c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [19]:
df.iloc[[1,2]]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

#####  중간값가져오기

In [20]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [21]:
df.loc[['b','c'],['last_name','age']]

  last_name  age
b  jacobson   52
c       ali   36

In [22]:
df.iloc[[1,2,3],[1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [23]:
df.iloc[1:4,1:3]       # index slicing

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [24]:
df.loc[:,'first_name' : 'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [25]:
df.loc[['a','b'],['first_name','age']]

  first_name  age
a      jason   42
b      molly   52

In [26]:
df.iloc[[0,1],[0,1]]

  first_name last_name
a      jason    miller
b      molly  jacobson

In [27]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [28]:
df.loc[['b','c'],['last_name','age','city']]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [29]:
df.loc[:,'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [30]:
df.iloc[1:3,1:13]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [31]:
df.age

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

####  나이가 40 이상만 출력

In [32]:
df[df['age']>40]

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
e        any     cooze   75         boston

####  마이애미사는 사람 데이터 추출

In [33]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [34]:
df[df['city']=='miami']

  first_name last_name  age   city
c       tina       ali   36  miami

#### 'ali'의 나이는?

In [35]:
df[df['last_name']=='ali'].age

c    36
Name: age, dtype: int64

In [36]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

### Transpose

In [37]:
df.T  #T : transpose, 행과 열을 바꿈

                        a          b      c        d       e
first_name          jason      molly   tina     jake     any
last_name          miller   jacobson    ali   milner   cooze
age                    42         52     36       24      75
city        san francisco  baltimore  miami  douglas  boston

In [38]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [39]:
df.columns

Index(['first_name', 'last_name', 'age', 'city'], dtype='object')

###  저장
    dataFrame.to_csv('파일명.csv')

In [40]:
df.to_csv('test_df.csv')

### 상위 / 하위 일부분 출력

In [41]:
df.head(2)  # 숫자 미입력시 5개 출력

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore

In [42]:
df.tail(3)  # 숫자 미입력시 5개 출력

  first_name last_name  age     city
c       tina       ali   36    miami
d       jake    milner   24  douglas
e        any     cooze   75   boston

### column, row 삭제
    1. del 사용 - del df[row or column]
    2. .drop(row or column)
        * drop으로 coulumn 삭제시 (칼럼명, axis=1)

In [43]:
del df['age']
df

  first_name last_name           city
a      jason    miller  san francisco
b      molly  jacobson      baltimore
c       tina       ali          miami
d       jake    milner        douglas
e        any     cooze         boston

In [44]:
df.drop('c')   # 원본파일에는 영향주지 않음

  first_name last_name           city
a      jason    miller  san francisco
b      molly  jacobson      baltimore
d       jake    milner        douglas
e        any     cooze         boston

In [45]:
del df

In [46]:
df = pd.read_csv('test_df.csv')
df

  Unnamed: 0 first_name last_name  age           city
0          a      jason    miller   42  san francisco
1          b      molly  jacobson   52      baltimore
2          c       tina       ali   36          miami
3          d       jake    milner   24        douglas
4          e        any     cooze   75         boston

In [47]:
del df['Unnamed: 0']
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [48]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

### apply

#### age칼럼의 값을 한국나이로 전환 (+1)

In [49]:
# for 사용
kage = []
for i in df.age :
    kage.append(i+1)
kage

[43, 53, 37, 25, 76]

In [50]:
# 함수정의 사용
def kage(a) :
    return a+1

In [51]:
df.age.apply(kage)

a    43
b    53
c    37
d    25
e    76
Name: age, dtype: int64

In [52]:
# lambda 사용
df.age.apply(lambda x : x+1)

a    43
b    53
c    37
d    25
e    76
Name: age, dtype: int64

### column 추가

In [53]:
df['job'] = ['teacher','driver','doctor','cook','engineer']
df

  first_name last_name  age           city       job
a      jason    miller   42  san francisco   teacher
b      molly  jacobson   52      baltimore    driver
c       tina       ali   36          miami    doctor
d       jake    milner   24        douglas      cook
e        any     cooze   75         boston  engineer

In [54]:
df['age'] = df['age'].apply(lambda x : x+1)
df

  first_name last_name  age           city       job
a      jason    miller   43  san francisco   teacher
b      molly  jacobson   53      baltimore    driver
c       tina       ali   37          miami    doctor
d       jake    milner   25        douglas      cook
e        any     cooze   76         boston  engineer

In [76]:
wages = pd.read_csv('wages.csv')
wages.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [78]:
wages.info()    # pandas의 object = str

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [80]:
wages.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [85]:
wages['height'] = wages['height'].apply(lambda x : int(x))
wages

              earn  height     sex   race  ed  age
0     79571.299011      73    male  white  16   49
1     96396.988643      66  female  white  16   62
2     48710.666947      63  female  white  16   33
3     80478.096153      63  female  other  16   95
4     82089.345498      63  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363      71    male  white  12   33
1375  24853.519514      61  female  white  18   86
1376  13710.671312      63  female  white  12   37
1377  95426.014410      71    male  white  12   54
1378   9575.461857      68    male  white  12   31

[1379 rows x 6 columns]

###  Groupby
    동일 종류의 데이터끼리 묶어서 처리
    df('칼럼')['칼럼'].연산함수  ->  ()은 기준이 될 값, []은 계산할 값

In [86]:
wages.groupby('sex')['earn'].mean()
# 이중구조
# 1. data grouping => wages.groupby('sex')
# 2. group별 값을 계산 => ['earn'].mean()

sex
female    24245.647877
male      45993.126922
Name: earn, dtype: float64

##### 인종별 평균 교육연수

In [88]:
wages.groupby('race')['ed'].mean()

race
black       13.039683
hispanic    12.987013
other       13.965517
white       13.398431
Name: ed, dtype: float64

In [91]:
data = {'Team' : ['Riders','Riders','Devils','Devils','Kings','Giant','Kings','Kings','Riders','Royals','Royals','Riders'],
       'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
       'Year' : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
       'Points':[876,788,863,673,741,812,956,788,694,701,804,923]}

In [93]:
df = pd.DataFrame(data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     788
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

##### 팀별 역대득점 총합

In [94]:
df.groupby('Team')['Points'].sum()

Team
Devils    1536
Giant      812
Kings     2485
Riders    3281
Royals    1525
Name: Points, dtype: int64

##### 팀별 최고성적순은?

In [96]:
df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

#####  연도별 최고 득점

In [97]:
df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    956
2017    923
Name: Points, dtype: int64

### grouped 객체

In [100]:
grouped = df.groupby('Team')

In [101]:
grouped.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     956
7  Kings     1  2017     788

In [102]:
grouped.get_group('Royals')

      Team  Rank  Year  Points
9   Royals     4  2014     721
10  Royals     1  2015     804

In [104]:
grouped.min()  # 각 column별 최소값 출력

        Rank  Year  Points
Team
Devils     2  2014     673
Giant      4  2015     812
Kings      1  2014     741
Riders     1  2014     694
Royals     1  2014     721

In [105]:
grouped.mean()

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Giant   4.000000  2015.000000  812.000000
Kings   1.666667  2015.666667  828.333333
Riders  1.750000  2015.500000  820.250000
Royals  2.500000  2014.500000  762.500000

In [106]:
grouped['Points'].mean()

Team
Devils    768.000000
Giant     812.000000
Kings     828.333333
Riders    820.250000
Royals    762.500000
Name: Points, dtype: float64

In [115]:
grouped[['Rank','Points']].agg([np.sum,np.mean,np.std])

       Rank                     Points
        sum      mean       std    sum        mean         std
Team
Devils    5  2.500000  0.707107   1536  768.000000  134.350288
Giant     4  4.000000       NaN    812  812.000000         NaN
Kings     5  1.666667  1.154701   2485  828.333333  113.032444
Riders    7  1.750000  0.500000   3281  820.250000  101.068871
Royals    5  2.500000  2.121320   1525  762.500000   58.689863

In [116]:
# df.groupedby('Team')['Points'].mean()
grouped = df.groupby('Team')
grouped['Points'].agg(np.mean)

Team
Devils    768.000000
Giant     812.000000
Kings     828.333333
Riders    820.250000
Royals    762.500000
Name: Points, dtype: float64